## Creating pandas dataframe

In [3]:
my_dict = { 
     'name' : ["a", "b", "c", "d", "e","f", "g"],
     'age' : [20,27, 35, 55, 18, 21, 35],
     'designation': ["VP", "CEO", "CFO", "VP", "VP", "CEO", "MD"]
}

In [44]:
import pandas as pd
df = pd.DataFrame(my_dict)
df2=pd.DataFrame(my_dict)

In [7]:
df

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO
3    d   55          VP
4    e   18          VP
5    f   21         CEO
6    g   35          MD

# Indexing rows

In [10]:
#To provide our own row index, we need to pass index parameter in the DataFrame(...) function as

df = pd.DataFrame(my_dict, index=[1,2,3,4,5,6,7])

In [11]:
df

  name  age designation
1    a   20          VP
2    b   27         CEO
3    c   35         CFO
4    d   55          VP
5    e   18          VP
6    f   21         CEO
7    g   35          MD

In [12]:
df = pd.DataFrame(
     my_dict, 
     index=["First", "Second", "Third", "Fourth", "Fifth", "Sixth", "Seventh"]
)          

#or we can pass string too

In [13]:
df

        name  age designation
First      a   20          VP
Second     b   27         CEO
Third      c   35         CFO
Fourth     d   55          VP
Fifth      e   18          VP
Sixth      f   21         CEO
Seventh    g   35          MD

# Checking the column types

In [20]:
#for a sinigle column
df['age'].dtype    # Dict Like Syntax

dtype('int64')

In [22]:
#or we may use this as well!
df.age.dtype       # DataFrame.ColumnName

dtype('int64')

In [23]:
#FOR ALL COLUMNS:

df.dtypes

name           object
age             int64
designation    object
dtype: object

# head(…) and tail(…) function

In [25]:
df.head()   # Displays 1st Five Rows

       name  age designation
First     a   20          VP
Second    b   27         CEO
Third     c   35         CFO
Fourth    d   55          VP
Fifth     e   18          VP

In [26]:
df.tail()    # Displays last Five Rows

        name  age designation
Third      c   35         CFO
Fourth     d   55          VP
Fifth      e   18          VP
Sixth      f   21         CEO
Seventh    g   35          MD

In [27]:
df.head(2)   # Displays 1st two Rows

       name  age designation
First     a   20          VP
Second    b   27         CEO

In [29]:
df.index     # For Row Indexes

Index(['First', 'Second', 'Third', 'Fourth', 'Fifth', 'Sixth', 'Seventh'], dtype='object')

In [30]:
df.columns   # For Columns

Index(['name', 'age', 'designation'], dtype='object')

# Columns Helper Functions

unique → Provide unique elements from a column by removing duplicates.

In [31]:
df.designation.unique()

array(['VP', 'CEO', 'CFO', 'MD'], dtype=object)

mean → Provided the mean value of all the items in the column

In [32]:
df.age.mean()

30.142857142857142

# Loading selective columns in DataFrame

In [33]:
df = pd.DataFrame(my_dict, columns=["name", "age"])   #here instead of my_dict you may use your dataset path

In [34]:
df

  name  age
0    a   20
1    b   27
2    c   35
3    d   55
4    e   18
5    f   21
6    g   35

# Deleting Rows and Columns from DataFrame

In [38]:
# To remove a Column, we’ll use del 
del df2['name']

In [39]:
df2

   age designation
0   20          VP
1   27         CEO
2   35         CFO
3   55          VP
4   18          VP
5   21         CEO
6   35          MD

Using Drop function → Allows us to delete Columns as well as Rows

Whether we’re going to delete Rows or Columns is decided by the second argument in the drop function.

*** The second argument “1” in function drop(...) denotes deletion of the “Column”, whereas “0” means deletion of the “Row ***

In [42]:
# Delete Column "age"
df.drop('age',1)

  name designation
0    a          VP
1    b         CEO
2    c         CFO
3    d          VP
4    e          VP
5    f         CEO
6    g          MD

In [43]:
# Delete the Row with Index "3"
df.drop(3,0)

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO
4    e   18          VP
5    f   21         CEO
6    g   35          MD

**We can also delete multiple Rows and Columns by passing the list in drop(...) function**

In [45]:
# Delete Columns "name" & "age"
df.drop(['name','age'],1)

  designation
0          VP
1         CEO
2         CFO
3          VP
4          VP
5         CEO
6          MD

In [46]:
# Delete Rows with index "2","3", & "4"
df.drop([2,3,4],0)

  name  age designation
0    a   20          VP
1    b   27         CEO
5    f   21         CEO
6    g   35          MD